from numpy import sqrt, array, sin, pi, tan
# в СИ #
lamda = 1064e-9 # м
chi = 10**-7 # (м ** 2)/с

tau_0 = 0.0016523 # с

roCp = 10**6 # Дж / (м**3 * К)
dedT = 1e-3 # 1/К
L = 5e-3 # м
d = 1e-3 # м
teta = 5/330 # Рад

# eeps = 8.85418781762039e-12# м−3·кг−1·с4·А2.
eps_0 = sqrt(1.5)

k = 2 * pi / lamda # 1/м
# Проекция волнового вектора на ось X #
k_x = k*sin(teta / 2) # 1/м

# Время релаксации решетки 
tau_relax = tau_0 / (1 + 4 * chi *k_x ** 2 * tau_0) # с
print(tau_relax)

# Массив  мощностей 
P_ref = array([160, 182, 233, 267, 293, 323])*1e-3

# Площадь пучка #
S_b = pi * (d / 2) ** 2

# I_0 #
I_0 = 2* P_ref / S_b 

sigma_0 =59.5e6 # Сименс/м (проводимость меди)

# Характеристика эффективности ПДВ #
G = sigma_0 * tau_relax * I_0 * dedT / (4 * eps_0 * roCp)

# Коэффициент отражения ОВФ-зеркала #
re = tan (G*L) # Коэффициент отражения
r = re**2 # Квадрат коэффициента отражения	

print(re)
print(r)